import fetch from 'node-fetch';

const handler = async (m, { conn }) => {
    const imageUrl = "https://files.catbox.moe/xxe7h1.jpg";

    const messageText = `
*『 ✧ مـرحبـاً بـك يا ⌊ ${m.pushName} ⌉ ✧ 』*  
*فـي قـسم ┇ التـرفيه 🎭 داخـل بـوت 𓆩𝑩𝑶𝑫𝒀𓆪*

╭───━ • ✦ • ━───╮  
   ⟡ ˚ ༘ ⋆｡𖦹  
   ˚⌝ قـسم الـتـرفيه 🎉⌞ ˚  
╰───━ • ✦ • ━───╯  

👥┊⇇『 ✧ أصحـاب ✧ 』  
⚔️┊⇇『 ✧ إعـدام ✧ 』  
🏆┊⇇『 ✧ تــوب ✧ 』  
🎭┊⇇『 ✧ الشخـصية ✧ 』  
🗣️┊⇇『 ✧ الصـراحة ✧ 』  
⚽┊⇇『 ✧ الكـورة ✧ 』  
😈┊⇇『 ✧ إنحـرافي ✧ 』  
🎸┊⇇『 ✧ إيـمو ✧ 』  
🐾┊⇇『 ✧ بوسـتات ✧ 』  
📝┊⇇『 ✧ بوسـت ✧ 』  
🚔┊⇇『 ✧ بــوليس ✧ 』  
💎┊⇇『 ✧ بيبضنـي ✧ 』  
❤️┊⇇『 ✧ بيحبنـي ✧ 』  
💔┊⇇『 ✧ بيكرهـني ✧ 』  
👑┊⇇『 ✧ تــاج ✧ 』  
💣┊⇇『 ✧ تفجيـر ✧ 』  
🔠┊⇇『 ✧ حـروف ✧ 』  
🍀┊⇇『 ✧ حظـي ✧ 』  
🐏┊⇇『 ✧ خـروف ✧ 』  
💍┊⇇『 ✧ خطـوبة ✧ 』  
🧠┊⇇『 ✧ ذكـاء ✧ 』  
🦾┊⇇『 ✧ رجـولتي ✧ 』  
🧑‍🤝‍🧑┊⇇『 ✧ رفـيق ✧ 』  
🎭┊⇇『 ✧ شخـصية ✧ 』  
🤝┊⇇『 ✧ صديـق ✧ 』  
🎤┊⇇『 ✧ صراحـتي ✧ 』  
💔┊⇇『 ✧ طـلاق ✧ 』  
💞┊⇇『 ✧ علاقـة ✧ 』  
❓┊⇇『 ✧ فزورة ✧ 』  
🎥┊⇇『 ✧ فيلـم ✧ 』  
🔪┊⇇『 ✧ قـتل ✧ 』  
🐱┊⇇『 ✧ قـطة ✧ 』  
📖┊⇇『 ✧ مقـولات ✧ 』  
🎲┊⇇『 ✧ نـرد ✧ 』  
📊┊⇇『 ✧ نـوعية ✧ 』  
🔍┊⇇『 ✧ هـذا ✧ 』  
❔┊⇇『 ✧ هـل ✧ 』  
⚰️┊⇇『 ✧ وفاتـي ✧ 』  

╭───━ • ✦ • ━───╮  
 > ✧ هذا القسم قيد التطوير ✧  
╰───━ • ✦ • ━───╯  

> بـودي بـــ𝑩𝑶𝑫𝒀ـــوت 🕷️💗
    `.trim();

    await conn.sendMessage(m.chat, { text: "*_⏳ جاري إرسال قسم الترفيه... 🎭_*" }, { quoted: m });

    await conn.sendMessage(m.chat, {
        image: { url: imageUrl },
        caption: messageText
    }, { quoted: m });

    await conn.sendMessage(m.chat, { react: { text: '🎭', key: m.key } });
};

handler.command = /^قسم-الترفيه$/i;
handler.tags = ["بــودي"];
handler.help = ["قسم-الترفيه"];

export default handler;