let handler = async (m, { conn, command, text }) => {
  if (!text) {
    let usageMsg = `
💀 *طريقة الاستخدام* 💀

اكتب الأمر متبوعًا باسم الشخص الذي تريد تحليل شخصيته.
مثال:
> • *.${command} محمد*
> • *.${command} فاطمة*

𝑩𝑶𝑫𝒀 💀
`.trim();
    return conn.reply(m.chat, usageMsg, m);
  }

  const personalidad = `
💀 *تحليل الشخصية العشوائي* 💀

💀 *الاسم*           : ${text}
💀 *الأخلاق الجيدة*  : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *الأخلاق السيئة*  : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *نوع الشخصية*     : ${pickRandom(['طيب القلب','متكبر','بخيل','كريم','متواضع','خجول','جبان','فضولي','قلبه هش','مزعج'])}
💀 *دائماً*          : ${pickRandom(['مشغول','متوتر','يتابع الأنمي','على الجوال طول الوقت','يسولف كثير','يسهر كثير','مزعج أحياناً','هادئ','يحب الشراء','يلعب ببجي','دائم التفكير'])}
💀 *الذكاء*          : ${pickRandom(['9%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *الغباء*          : ${pickRandom(['9%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *الشجاعة*         : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *الخوف*          : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *الشهرة*         : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98.3%','99.7%','99.9%','1%','2.9%','0%','0.4%'])}
💀 *النوع*          : ${pickRandom(['رجل','امرأة','محب الرجال','محب النساء','ثنائي الميول','لا أدري','قوي الشخصية','مغرور','هادئ','غامض'])}

𝑩𝑶𝑫𝒀 💀
`.trim();

  conn.reply(m.chat, personalidad, m);
};

handler.help = ['personalidad', 'شخصيه', 'شخصية'];
handler.tags = ['fun'];
handler.command = ['personalidad', 'شخصيه', 'شخصية'];
handler.group = false;

export default handler;

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)];
}